---
kind: type
id: T:Autodesk.Revit.DB.ParameterValue
source: html/366521ef-ecc2-c3e3-feb5-81b3bbd8df0c.htm
---
# Autodesk.Revit.DB.ParameterValue

A class that holds a value of a parameter element.

## Syntax (C#)
```csharp
public class ParameterValue : IDisposable
```

## Remarks
This is a non-instantiable base class.
 Classes that actually store a value of a certain type are all
 derived from this base class, once class per each value type.